{"wpforms-activecampaign":{"title":"ActiveCampaign Addon","slug":"wpforms-activecampaign","url":"https:\/\/wpforms.com\/addons\/activecampaign-addon\/","version":"1.7.0","image":"https:\/\/wpforms.com\/wp-content\/uploads\/2020\/03\/addon-icon.png","excerpt":"The WPForms ActiveCampaign addon lets you add contacts to your account, record events, add notes to contacts, and more.","doc":"https:\/\/wpforms.com\/docs\/how-to-install-and-use-the-activecampaign-addon-with-wpforms\/","id":729633,"license":["agency","elite","ultimate"],"category":["providers"],"changelog":["<h4>1.7.0 (2025-09-02)<\/h4><ul> <li>IMPORTANT: Support for PHP 7.1 has been discontinued. If you are running PHP 7.1, you MUST upgrade PHP before installing this addon. Failure to do that will disable addon functionality.<\/li> <li>Changed: The minimum WPForms version supported is 1.9.5.<\/li><\/ul>","<h4>1.6.0 (2024-08-29)<\/h4><ul> <li>Support for PHP 5.6 has been discontinued. If you are running PHP 5.6, you MUST upgrade PHP before installing WPForms ActiveCampaign 1.6.0. Failure to do that will disable WPForms ActiveCampaign functionality.<\/li> <li>Support for WordPress 5.4 and below has been discontinued. If you are running any of those outdated versions, you MUST upgrade WordPress before installing WPForms ActiveCampaign 1.6.0. Failure to do that will disable WPForms ActiveCampaign functionality.<\/li> <li>Added: Account and Job Title contact fields can now be mapped on the Form Builder &gt; Marketing &gt; ActiveCampaign screen.<\/li> <li>Added: Dynamic filter <code>wpforms_active_campaign_api_v3_endpoints_resource_get_limit_$type<\/code> to change the limit of any resource to retrieve - custom fields, tags, contacts, lists and events.<\/li> <li>Changed: The minimum WPForms version supported is 1.9.0.<\/li> <li>Fixed: PHP notice generated when trying to send a form with a selected but not set up custom meta field.<\/li><\/ul>","<h4>1.5.0 (2022-09-20)<\/h4><ul> <li>Fixed: Warning notice on form submissions when no ActiveCampaign account was selected.<\/li><\/ul>","<h4>1.4.0 (2022-06-28)<\/h4><ul> <li>Added: Possibility to use Smart Tags in Notes.<\/li> <li>Changed: Minimum WPForms version supported is 1.7.5.<\/li> <li>Changed: Reorganized locations of 3rd party libraries.<\/li><\/ul>","<h4>1.3.0 (2022-05-26)<\/h4><ul> <li>IMPORTANT: Support for WordPress 5.1 has been discontinued. If you are running WordPress 5.1, you MUST upgrade WordPress before installing the new WPForms ActiveCampaign. Failure to do that will disable the new WPForms ActiveCampaign functionality.<\/li> <li>Added: Compatibility with WPForms 1.6.8 and the updated Form Builder.<\/li> <li>Changed: Minimum WPForms version supported is 1.7.3.<\/li> <li>Changed: Replaced <code>jQuery.isFunction()<\/code> (deprecated as of jQuery 3.3) usages with a recommended counterpart.<\/li> <li>Fixed: Properly handle the situation when trying to change the template for the same form multiple times.<\/li> <li>Fixed: Send to ActiveCampaign form submission data even when the \"Entry storage\" option is disabled in the Form Builder.<\/li> <li>Fixed: CSS improvements of Add New Event button when a connection with the \"Event Tracking\" action was created.<\/li><\/ul>","<h4>1.2.1 (2020-08-05)<\/h4><ul> <li>Fixed: API key\/token expiration detection missing.<\/li> <li>Fixed: Properly initialize a template inside the Form Builder addon configuration area for conditional logic.<\/li> <li>Fixed: Allow a simple format of the form \"Name\" field to correctly pass data to ActiveCampaign \"Full Name\" field.<\/li><\/ul>","<h4>1.2.0 (2020-04-29)<\/h4><ul> <li>Changed: Greatly improved tags management UI.<\/li> <li>Changed: Improved various field labels\/descriptions inside the Form Builder.<\/li> <li>Fixed: Compatibility with WordPress Multisite when WPForms activated Network-wide, and addon - site-wide.<\/li> <li>Fixed: Do not send Event-related ActiveCampaign API requests when there are no required account ID and event key.<\/li><\/ul>","<h4>1.1.0 (2020-03-16)<\/h4><ul> <li>Added: Process smart tags inside notes to 